<template>
    <div class="body loginUserInfo">
        <laypage class="headShadow">
            <div class="agreement">
                您需要完全同意下列所有条款后才可以完成注册并以用户身份使用“三师汇”平台的服务。“三师汇”（以下简称为“平台”）依据并遵守以下条款为您提供服务。<br/><br/>
                <h5>一、接受条款</h5><br/>
                第1条 请在注册前仔细阅读本协议，同意协议内容，请点击“同意条款”，代表您与“平台”达成协议，完全接受本协议的全部条款。<br/><br/>
                第2条 “平台”有定期修订本协议条款内容的权利，“平台”会在协议修改后用户首次登录时将修改内容显示给您，您继续使用即代表接受“平台”修改的全部内容。<br/><br/>
                <h5>二、服务说明</h5><br/>
                第3条 “平台”是为企业、专业服务机构、学生、专业人员提供信息交流、工作机会的交流平台。“平台”将基于微信公众号为用户提供相关服务。<br/><br/>
                第4条 “平台”保留变更、中断、终止服务的权利，对于付费功能，将根据对付费用户造成的影响程度给予退款、赔偿；但“平台”不承担由于调整非付费功能给用户造成的损失。<br/><br/>
                <h5>三、隐私保护</h5><br/>
                第5条 用户注册时需要提供一些必要的信息，“平台”对用户提供的信息进行必要的审核，信息内容有违反法律、行政法规、部门规章、地方性法规等，或信息不完整、不规范的，“平台”有权要求用户修改、重新提供、限制或终止用户在“平台”的使用权限。<br/><br/>
                第6条 “平台”有权要求企业提供相应的资质文件（包括但不限于营业执照、经营许可证等），并依据常识及社会大众通常智力水平做出是否合规的判断而不必须依据权力机关事后通知、查处、判决等文件。对于涉及经营人力资源外包业务、猎头业务、招聘业务等可能与本“平台”业务存在竞争关系或利益冲突的企业，“平台”保留拒绝其注册、继续使用“平台”的权利。<br/><br/>
                第7条 用户同意“平台”在下述事项中使用个人隐私信息：<br/>
                1.“平台”向用户及时发送重要通知，如软件更新、本协议条款的变更；<br/>
                2.“平台”内部进行审计、数据分析和研究等，以改进“平台”的产品、服务和与用户之间的沟通；<br/>
                3.依本协议约定，“平台”管理、审查用户信息及进行处理措施；<br/>
                4.适用法律法规规定的其他事项。<br/><br/>
                第8条 “平台”未经用户同意不向任何第三方公开、透露用户的个人隐私信息。但以下情形除外：<br/>
                1.在“平台”内部提供给“平台”注册用户查阅，但供查阅的信息不包括个人身份证号码，以及用户在个人资料中选择“匿名”后的用户的真实姓名、现就职单位；<br/>
                2.根据法律法规规定或有权机关的指示提供用户的个人隐私信息；<br/>
                3.由于用户将其用户密码告知他人或与他人共享注册帐户与密码，由此导致的任何个人信息的泄漏，或其他非因“平台”原因导致的个人隐私信息的泄露；<br/>
                4.用户自行向第三方公开其个人隐私信息；<br/>
                5.用户与“平台”及合作单位之间就用户个人隐私信息的使用公开达成约定，“平台”因此向合作单位公开用户个人隐私信息；<br/>
                6.任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露。<br/><br/>
                <h5>四、“平台”服务须知</h5><br/>
                第9条 用户在“平台”所发布的任何信息，都有可能被任何访问“平台”的其他用户浏览，也可能造成错误的、不当的使用。“平台”不对此承担任何责任。<br/><br/>
                第10条 “平台”将不能保证所有用户发布的信息的完全准确性，使用者在使用信息时，需要进一步核实。“平台”对使用者未经自行审核误用网站信息造成的任何损失不承担任何责任。<br/><br/>
                第11条 企业或机构使用个人简历信息时，仅能用于招聘为目的。若“平台”发现企业或机构有转卖个人信息嫌疑，将对企业或机构进行封禁。<br/><br/>
                第12条 因第三方提出的涉及知识产权的权利主张或者行政、司法机关的介入，“平台”有权披露企业或机构的相关信息。<br/><br/>
                第13条 “平台”作为信息服务平台，所有个人信息、职位信息均由用户自行发布。“平台”对发布用户的真实资信状况、发布信息的真实性、合法性、准确性等不作保证。因上述原因导致的对其他用户或第三方造成的损失，“平台”不承担责任。<br/><br/>
                第14条 “平台”不保证系统能够满足所有企业、个人的需求；不出现任何的系统宕机、波动；不出现任何的数据丢失。因“平台”运营商原因、“平台”进行程序调整、正常的系统维护升级等造成的本“平台”无法正常访问，本“平台”不承担任何责任。<br/><br/>
                <h5>五、知识产权</h5><br/>
                第15条 “平台”发布的任何图形、文字等均属“平台”所有，受相关法律和知识产权法保护。未经书面许可，任何人不得下载、复制、再使用。“平台”发布的全部商标，归其相应的商标所有权人，受商标法保护。<br/><br/>
                第16条 “平台”使用的软件程序归北京中和网汇科技有限公司所有。<br/><br/>
                <h5>六、用户行为</h5><br/>
                第17条 用户同意将不会利用本“平台”进行任何违法或不正当的活动，包括但不限于下列行为：<br/>
                1.发布或以其它方式传送含有下列内容之一的信息：<br/>
                反对宪法所确定的基本原则的；<br/>
                危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br/>
                损害国家荣誉和利益的；<br/>
                煽动民族仇恨、民族歧视、破坏民族团结的；<br/>
                破坏国家宗教政策，宣扬邪教和封建迷信的；<br/>
                散布谣言，扰乱社会秩序，破坏社会稳定的；<br/>
                散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br/>
                侮辱或者诽谤他人，侵害他人合法权利的；<br/>
                含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；<br/>
                含有中国法律、法规、规章、条例以及任何具有法律效力的规范所限制或禁止的其它内容的；<br/>
                “平台”认为不适合在“平台”上展示的内容；<br/>
                2.以任何方式危害他人的合法权益；<br/>
                3.冒充其他任何人或机构，或以虚伪不实的方式陈述或谎称与任何人或机构有关；<br/>
                4.发布、传送依据任何法律、合约或法定关系知悉但无权传送的任何内容；<br/>
                5.发布、传送侵害他人著作权、专利权、商标权、商业秘密、或其它专属权利的内容；<br/>
                6.发布、传送任何广告信函、促销资料、“垃圾邮件”、“滥发信件”、“连锁信件”、“直销”或其它任何形式的劝诱资料；<br/>
                7.发布或发送设计目的是干扰、破坏或限制任何计算机软件、硬件或通讯设备功能之计算机病毒（包括但不限于木马程序、蠕虫、定时炸弹等）；<br/>
                8.干扰或破坏本“平台”或与本“平台”相连线之服务器和网络，或违反任何关于本“平台”连线网络之规定、程序、政策或规范；<br/>
                9.跟踪、人肉搜索或以其它方式骚扰他人；<br/>
                10.故意或非故意地违反任何适用的当地、国家法律，以及任何具有法律效力的规则；<br/>
                11.未经合法授权而截获、篡改、收集、储存或删除他人个人信息、站内邮件或其它数据资料，或将获知的此类资料用于任何非法或不正当目的。<br/><br/>
                第18条 您已认可“平台”未对用户的使用行为进行全面控制，您使用任何内容时，包括依赖前述内容之正确性、完整性或实用性时，您同意将自行加以判断并承担所有风险，而不依赖于“平台”。<br/><br/>
                第19条 您了解并同意，“平台”依据法律法规的要求，或基于诚信为了以下目的或在合理必要范围内，认定必须将内容加以保存或揭露时，可以保存或揭露：<br/>
                1.遵守法律程序；<br/>
                2.执行本使用协议；<br/>
                3.回应任何第三人提出的权利主张；<br/>
                4.保护“平台”、其用户及公众之权利、财产或个人安全；<br/>
                5.其它“平台”认为有必要的情况。<br/><br/>
                <h5>七、其他条款</h5><br/>
                第20条 “平台”有权在预先通知或不予通知的情况下终止任何免费服务。<br/><br/>
                第21条 “平台”有权但无义务，改善或更正本“平台”任何部分的任何疏漏、错误。<br/><br/>
                第22条 企业或个人与“平台”的任何纠纷，可以通过协商的途径解决。协商不成的，任何一方可向“平台”登记住所地的人民法院提起诉讼。<br/><br/>
                第23条 本协议的订立、生效、解释、执行、管辖、争议的解决均适用中华人民共和国法律。<br/><br/>
                第24条 如本用户条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，本用户条款的其余条款仍应有效并且有约束力。<br/><br/>
                第25条 “平台”所有的服务解释权归北京中和网汇科技有限公司所有。<br/><br/>
            </div>
        </laypage>
    </div>
</template>

<script>
    export default {
        name: 'Login',
        data() {
            return {

            }
        },
        created() {
            this.$nextTick(()=>{
                this.$store.dispatch('userLoginOut')
            })
        },

    }
</script>

